#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/hechaorganization/golang-napoli-workspace/runs/run-TrWgJ111AdTjBUFb

Waiting for the plan to start...

Terraform v1.3.7
on linux_amd64
Initializing plugins and modules...
module.iam.aws_iam_user_policy_attachment.github_actions_policy_attachment: Refreshing state... [id=demo-iac-golang-napoli-20230311170341654700000001]
module.security.data.aws_iam_user.github_actions: Reading...
module.infrastructure.aws_s3_bucket_policy.bucket_policy: Refreshing state... [id=terraform-golang-napoli]
module.infrastructure.aws_s3_bucket_website_configuration.bucket_website: Refreshing state... [id=terraform-golang-napoli]
module.infrastructure.aws_route53_record.A_record: Refreshing state... [id=Z04217553VJM3IP6I6W8T_terraform.ettoreciarcia.com_A]
module.infrastructure.aws_route53_record.AAAA_record: Refreshing state... [id=Z04217553VJM3IP6I6W8T_terraform.ettoreciarcia.com_AAAA]
module.iam.aws_iam_policy.github_actions_policy: Refreshing state... [id=arn:aws:iam::860443674636:policy/terraform-dev-github-actions-policy]
module.infrastructure.aws_s3_bucket_acl.bucket_acl: Refreshing state... [id=terraform-golang-napoli,public-read]
module.infrastructure.aws_s3_bucket.website: Refreshing state... [id=terraform-golang-napoli]
module.infrastructure.module.cdn_website.aws_cloudfront_distribution.this[0]: Refreshing state... [id=E1IIIA1CXBEE3X]
module.security.data.aws_iam_user.github_actions: Read complete after 0s [id=AIDA4QVTQRAGA4OYNGDTC]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.iam.aws_iam_policy.github_actions_policy will be destroyed
  # (because aws_iam_policy.github_actions_policy is not in configuration)
  - resource "aws_iam_policy" "github_actions_policy" {
      - arn       = "arn:aws:iam::860443674636:policy/terraform-dev-github-actions-policy" -> null
      - id        = "arn:aws:iam::860443674636:policy/terraform-dev-github-actions-policy" -> null
      - name      = "terraform-dev-github-actions-policy" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:*",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::terraform-golang-napoli",
                          - "arn:aws:s3:::terraform-golang-napoli/*",
                        ]
                    },
                  - {
                      - Action   = "cloudfront:CreateInvalidation"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cloudfront::860443674636:distribution/E1IIIA1CXBEE3X"
                      - Sid      = "VisualEditor0"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPA4QVTQRAGPPFWHXIAU" -> null
      - tags      = {} -> null
      - tags_all  = {
          - "Application" = "terraform"
          - "Environment" = "dev"
        } -> null
    }

  # module.iam.aws_iam_user_policy_attachment.github_actions_policy_attachment will be destroyed
  # (because aws_iam_user_policy_attachment.github_actions_policy_attachment is not in configuration)
  - resource "aws_iam_user_policy_attachment" "github_actions_policy_attachment" {
      - id         = "demo-iac-golang-napoli-20230311170341654700000001" -> null
      - policy_arn = "arn:aws:iam::860443674636:policy/terraform-dev-github-actions-policy" -> null
      - user       = "demo-iac-golang-napoli" -> null
    }

  # module.infra.aws_route53_record.AAAA_record will be created
  + resource "aws_route53_record" "AAAA_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "terraform.ettoreciarcia.com"
      + type            = "AAAA"
      + zone_id         = "Z04217553VJM3IP6I6W8T"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.infra.aws_route53_record.A_record will be created
  + resource "aws_route53_record" "A_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "terraform.ettoreciarcia.com"
      + type            = "A"
      + zone_id         = "Z04217553VJM3IP6I6W8T"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.infra.aws_s3_bucket.website will be created
  + resource "aws_s3_bucket" "website" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "terraform-golang-napoli"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "Application" = "terraform"
          + "Environment" = "dev"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # module.infra.aws_s3_bucket_acl.bucket_acl will be created
  + resource "aws_s3_bucket_acl" "bucket_acl" {
      + acl    = "public-read"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # module.infra.aws_s3_bucket_policy.bucket_policy will be created
  + resource "aws_s3_bucket_policy" "bucket_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::terraform-golang-napoli/*"
                      + Sid       = "PublicReadGetObject"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.infra.aws_s3_bucket_website_configuration.bucket_website will be created
  + resource "aws_s3_bucket_website_configuration" "bucket_website" {
      + bucket           = "terraform-golang-napoli"
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + error_document {
          + key = "error.html"
        }

      + index_document {
          + suffix = "index.html"
        }

      + routing_rule {
          + condition {
              + http_error_code_returned_equals = (known after apply)
              + key_prefix_equals               = (known after apply)
            }

          + redirect {
              + host_name               = (known after apply)
              + http_redirect_code      = (known after apply)
              + protocol                = (known after apply)
              + replace_key_prefix_with = (known after apply)
              + replace_key_with        = (known after apply)
            }
        }
    }

  # module.infrastructure.aws_route53_record.AAAA_record will be destroyed
  # (because aws_route53_record.AAAA_record is not in configuration)
  - resource "aws_route53_record" "AAAA_record" {
      - fqdn    = "terraform.ettoreciarcia.com" -> null
      - id      = "Z04217553VJM3IP6I6W8T_terraform.ettoreciarcia.com_AAAA" -> null
      - name    = "terraform.ettoreciarcia.com" -> null
      - records = [] -> null
      - ttl     = 0 -> null
      - type    = "AAAA" -> null
      - zone_id = "Z04217553VJM3IP6I6W8T" -> null

      - alias {
          - evaluate_target_health = false -> null
          - name                   = "d6qd8l9acahy1.cloudfront.net" -> null
          - zone_id                = "Z2FDTNDATAQYW2" -> null
        }
    }

  # module.infrastructure.aws_route53_record.A_record will be destroyed
  # (because aws_route53_record.A_record is not in configuration)
  - resource "aws_route53_record" "A_record" {
      - fqdn    = "terraform.ettoreciarcia.com" -> null
      - id      = "Z04217553VJM3IP6I6W8T_terraform.ettoreciarcia.com_A" -> null
      - name    = "terraform.ettoreciarcia.com" -> null
      - records = [] -> null
      - ttl     = 0 -> null
      - type    = "A" -> null
      - zone_id = "Z04217553VJM3IP6I6W8T" -> null

      - alias {
          - evaluate_target_health = false -> null
          - name                   = "d6qd8l9acahy1.cloudfront.net" -> null
          - zone_id                = "Z2FDTNDATAQYW2" -> null
        }
    }

  # module.infrastructure.aws_s3_bucket.website will be destroyed
  # (because aws_s3_bucket.website is not in configuration)
  - resource "aws_s3_bucket" "website" {
      - arn                         = "arn:aws:s3:::terraform-golang-napoli" -> null
      - bucket                      = "terraform-golang-napoli" -> null
      - bucket_domain_name          = "terraform-golang-napoli.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "terraform-golang-napoli.s3.eu-west-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z1BKCTXD74EZPE" -> null
      - id                          = "terraform-golang-napoli" -> null
      - object_lock_enabled         = false -> null
      - policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::terraform-golang-napoli/*"
                      - Sid       = "PublicReadGetObject"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - region                      = "eu-west-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {
          - "Application" = "terraform"
          - "Environment" = "dev"
        } -> null
      - website_domain              = "s3-website-eu-west-1.amazonaws.com" -> null
      - website_endpoint            = "terraform-golang-napoli.s3-website-eu-west-1.amazonaws.com" -> null

      - grant {
          - permissions = [
              - "READ",
            ] -> null
          - type        = "Group" -> null
          - uri         = "http://acs.amazonaws.com/groups/global/AllUsers" -> null
        }
      - grant {
          - id          = "7dbb33d50f1185d8b0e8ccc4241c90833e51fa601b888efd194423ed80e04d83" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      - website {
          - error_document = "error.html" -> null
          - index_document = "index.html" -> null
        }
    }

  # module.infrastructure.aws_s3_bucket_acl.bucket_acl will be destroyed
  # (because aws_s3_bucket_acl.bucket_acl is not in configuration)
  - resource "aws_s3_bucket_acl" "bucket_acl" {
      - acl    = "public-read" -> null
      - bucket = "terraform-golang-napoli" -> null
      - id     = "terraform-golang-napoli,public-read" -> null

      - access_control_policy {
          - grant {
              - permission = "READ" -> null

              - grantee {
                  - type = "Group" -> null
                  - uri  = "http://acs.amazonaws.com/groups/global/AllUsers" -> null
                }
            }
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - display_name = "ettoreciarcia.tech" -> null
                  - id           = "7dbb33d50f1185d8b0e8ccc4241c90833e51fa601b888efd194423ed80e04d83" -> null
                  - type         = "CanonicalUser" -> null
                }
            }

          - owner {
              - display_name = "ettoreciarcia.tech" -> null
              - id           = "7dbb33d50f1185d8b0e8ccc4241c90833e51fa601b888efd194423ed80e04d83" -> null
            }
        }
    }

  # module.infrastructure.aws_s3_bucket_policy.bucket_policy will be destroyed
  # (because aws_s3_bucket_policy.bucket_policy is not in configuration)
  - resource "aws_s3_bucket_policy" "bucket_policy" {
      - bucket = "terraform-golang-napoli" -> null
      - id     = "terraform-golang-napoli" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::terraform-golang-napoli/*"
                      - Sid       = "PublicReadGetObject"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
    }

  # module.infrastructure.aws_s3_bucket_website_configuration.bucket_website will be destroyed
  # (because aws_s3_bucket_website_configuration.bucket_website is not in configuration)
  - resource "aws_s3_bucket_website_configuration" "bucket_website" {
      - bucket           = "terraform-golang-napoli" -> null
      - id               = "terraform-golang-napoli" -> null
      - website_domain   = "s3-website-eu-west-1.amazonaws.com" -> null
      - website_endpoint = "terraform-golang-napoli.s3-website-eu-west-1.amazonaws.com" -> null

      - error_document {
          - key = "error.html" -> null
        }

      - index_document {
          - suffix = "index.html" -> null
        }
    }

  # module.security.aws_iam_policy.github_actions_policy will be created
  + resource "aws_iam_policy" "github_actions_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "terraform-dev-github-actions-policy"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = {
          + "Application" = "terraform"
          + "Environment" = "dev"
        }
    }

  # module.security.aws_iam_user_policy_attachment.github_actions_policy_attachment will be created
  + resource "aws_iam_user_policy_attachment" "github_actions_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "demo-iac-golang-napoli"
    }

  # module.infra.module.cdn_website.aws_cloudfront_distribution.this[0] will be created
  + resource "aws_cloudfront_distribution" "this" {
      + aliases                        = [
          + "terraform.ettoreciarcia.com",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + default_root_object            = "index.html"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = true
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_All"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags_all                       = {
          + "Application" = "terraform"
          + "Environment" = "dev"
        }
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = false

      + default_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = 0
          + target_origin_id       = "s3_origin_data"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = [
                  + "Access-Control-Request-Headers",
                  + "Access-Control-Request-Method",
                  + "Authorization",
                  + "Origin",
                ]
              + query_string            = true
              + query_string_cache_keys = []

              + cookies {
                  + forward           = "all"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = (known after apply)
          + origin_id           = "s3_origin_data"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "http-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:860443674636:certificate/179e49d6-9330-4bb4-9d62-bb53ead3cbc1"
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.infrastructure.module.cdn_website.aws_cloudfront_distribution.this[0] will be destroyed
  # (because aws_cloudfront_distribution.this is not in configuration)
  - resource "aws_cloudfront_distribution" "this" {
      - aliases                        = [
          - "terraform.ettoreciarcia.com",
        ] -> null
      - arn                            = "arn:aws:cloudfront::860443674636:distribution/E1IIIA1CXBEE3X" -> null
      - caller_reference               = "terraform-20230309235924014400000001" -> null
      - default_root_object            = "index.html" -> null
      - domain_name                    = "d6qd8l9acahy1.cloudfront.net" -> null
      - enabled                        = true -> null
      - etag                           = "E22LFXF9HJ1QPO" -> null
      - hosted_zone_id                 = "Z2FDTNDATAQYW2" -> null
      - http_version                   = "http2" -> null
      - id                             = "E1IIIA1CXBEE3X" -> null
      - in_progress_validation_batches = 0 -> null
      - is_ipv6_enabled                = true -> null
      - last_modified_time             = "2023-03-09 23:59:24.142 +0000 UTC" -> null
      - price_class                    = "PriceClass_All" -> null
      - retain_on_delete               = false -> null
      - status                         = "Deployed" -> null
      - tags                           = {} -> null
      - tags_all                       = {
          - "Application" = "terraform"
          - "Environment" = "dev"
        } -> null
      - trusted_key_groups             = [
          - {
              - enabled = false
              - items   = []
            },
        ] -> null
      - trusted_signers                = [
          - {
              - enabled = false
              - items   = []
            },
        ] -> null
      - wait_for_deployment            = false -> null

      - default_cache_behavior {
          - allowed_methods        = [
              - "DELETE",
              - "GET",
              - "HEAD",
              - "OPTIONS",
              - "PATCH",
              - "POST",
              - "PUT",
            ] -> null
          - cached_methods         = [
              - "GET",
              - "HEAD",
            ] -> null
          - compress               = false -> null
          - default_ttl            = 0 -> null
          - max_ttl                = 0 -> null
          - min_ttl                = 0 -> null
          - smooth_streaming       = false -> null
          - target_origin_id       = "s3_origin_data" -> null
          - trusted_key_groups     = [] -> null
          - trusted_signers        = [] -> null
          - viewer_protocol_policy = "redirect-to-https" -> null

          - forwarded_values {
              - headers                 = [
                  - "Access-Control-Request-Headers",
                  - "Access-Control-Request-Method",
                  - "Authorization",
                  - "Origin",
                ] -> null
              - query_string            = true -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "all" -> null
                  - whitelisted_names = [] -> null
                }
            }
        }

      - origin {
          - connection_attempts = 3 -> null
          - connection_timeout  = 10 -> null
          - domain_name         = "terraform-golang-napoli.s3-website-eu-west-1.amazonaws.com" -> null
          - origin_id           = "s3_origin_data" -> null

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "http-only" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                ] -> null
            }
        }

      - restrictions {
          - geo_restriction {
              - locations        = [] -> null
              - restriction_type = "none" -> null
            }
        }

      - viewer_certificate {
          - acm_certificate_arn            = "arn:aws:acm:us-east-1:860443674636:certificate/179e49d6-9330-4bb4-9d62-bb53ead3cbc1" -> null
          - cloudfront_default_certificate = false -> null
          - minimum_protocol_version       = "TLSv1" -> null
          - ssl_support_method             = "sni-only" -> null
        }
    }

Plan: 9 to add, 0 to change, 9 to destroy.

Changes to Outputs:
  + bucket_arn                          = (known after apply)
  + bucket_name                         = (known after apply)
  + cloudfront_distribution_arn         = (known after apply)
  + cloudfront_distribution_domain_name = (known after apply)
  + cloudfront_distribution_id          = (known after apply)

```

</details>

*Pushed by: @ettoreciarcia, Action: `pull_request`*